Repository: AhmedRaslan2022/TMDB_2026
Catalog: Packages/Features/Sources/FeatureSearch/Resources/Localizable.xcstrings
Source language: en
Languages: ar

source: A–Z
ar: أ–ي

source: Any Rating
ar: أي تقييم

source: Any Year
ar: أي سنة

source: Clear
ar: مسح

source: Clear All
ar: مسح الكل

source: Couldn't Load
ar: تعذّر التحميل

source: Delete
ar: حذف

source: Discover
ar: استكشاف

source: Filters
ar: عوامل التصفية

source: Find movies by title.
ar: ابحث عن الأفلام بالعنوان.

source: Loading results
ar: جارٍ تحميل النتائج

source: Newest
ar: الأحدث

source: No Matches
ar: لا توجد نتائج

source: No movies match these filters. Try loosening them.
ar: لا توجد أفلام مطابقة لعوامل التصفية هذه. جرّب تخفيفها.

source: Popularity
ar: الرواج

source: Rating
ar: التقييم

source: Recent
ar: عمليات البحث الأخيرة

source: Search
ar: بحث

source: Search Failed
ar: فشل البحث

source: Search movies
ar: ابحث عن الأفلام

source: Search Movies
ar: البحث عن الأفلام

source: Searching
ar: جارٍ البحث

source: Sort
ar: الترتيب

source: Top Rated
ar: الأعلى تقييمًا

source: Year
ar: السنة
